In [18]:
import pandas as pd

In [59]:
pd.read_csv("nba.csv")
pd.read_csv("nba.csv", parse_dates = ["Birthday"])

               Name                 Team Position   Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF 1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG 1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26     79568
..              ...                  ...      ...        ...       ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 5 columns]

In [ ]:
nba = pd.read_csv("nba.csv", parse_dates = ["Birthday"])
nba.head(2)

## Attributes

In [20]:
nba.shape

(450, 5)

In [21]:
nba.axes

[RangeIndex(start=0, stop=450, step=1),
 Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')]

In [22]:
nba.size

2250

## Methods

In [23]:
nba.sample(3)

,Name,Team,Position,Birthday,Salary
392,Jalen Lecque,Phoenix Suns,G,2000-06-13,898310
144,Kentavious Caldwell-Pope,Los Angeles Lakers,SG,1993-02-18,8089282
294,Jordan Bell,Minnesota Timberwolves,C,1995-01-07,1620564

In [24]:
nba.count()

Name        450
Team        450
Position    450
Birthday    450
Salary      450
dtype: int64

In [25]:
nba.count().sum()

2250

In [26]:
nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [27]:
nba.max()

Name             Zylan Cheatham
Team         Washington Wizards
Position                     SG
Birthday    2000-12-23 00:00:00
Salary                 40231758
dtype: object

In [28]:
nba.min()

Name               Aaron Gordon
Team              Atlanta Hawks
Position                      C
Birthday    1977-01-26 00:00:00
Salary                    79568
dtype: object

## Select One or More Columns

In [30]:
nba.Name

nba["Name"]

0        Shake Milton
1      Christian Wood
2       PJ Washington
3        Derrick Rose
4       Marial Shayok
            ...
445     Austin Rivers
446       Harry Giles
447       Robin Lopez
448     Collin Sexton
449       Ricky Rubio
Name: Name, Length: 450, dtype: object

In [32]:
nba["Team"].head()

0    Philadelphia 76ers
1       Detroit Pistons
2     Charlotte Hornets
3       Detroit Pistons
4    Philadelphia 76ers
Name: Team, dtype: object

In [35]:
nba[["Team", "Birthday"]]

nba[["Birthday", "Team"]]

      Birthday                 Team
0   1996-09-26   Philadelphia 76ers
1   1995-09-27      Detroit Pistons
2   1998-08-23    Charlotte Hornets
3   1988-10-04      Detroit Pistons
4   1995-07-26   Philadelphia 76ers
..         ...                  ...
445 1992-08-01      Houston Rockets
446 1998-04-22     Sacramento Kings
447 1988-04-01      Milwaukee Bucks
448 1999-01-04  Cleveland Cavaliers
449 1990-10-21         Phoenix Suns

[450 rows x 2 columns]

In [81]:
nba["Salary"]

nba["Salary"].sum()

3444112694

In [82]:
nba["Salary"].mean()

7653583.764444444

In [83]:
nba["Salary"].median()

3303074.5

## Sort By Column Values

In [39]:
nba.sort_values("Name")
nba.sort_values(by = "Name")

                  Name                   Team Position   Birthday    Salary
52        Aaron Gordon          Orlando Magic       PF 1995-09-16  19863636
101      Aaron Holiday         Indiana Pacers       PG 1996-09-30   2239200
437        Abdel Nader  Oklahoma City Thunder       SF 1993-09-25   1618520
81         Adam Mokoka          Chicago Bulls        G 1998-07-18     79568
399  Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000
..                 ...                    ...      ...        ...       ...
159        Zach LaVine          Chicago Bulls       PG 1995-03-10  19500000
302       Zach Norvell     Los Angeles Lakers       SG 1997-12-09     79568
312       Zhaire Smith     Philadelphia 76ers       SG 1999-06-04   3058800
137    Zion Williamson   New Orleans Pelicans        F 2000-07-06   9757440
248     Zylan Cheatham   New Orleans Pelicans       SF 1995-11-17     79568

[450 rows x 5 columns]

In [40]:
nba.sort_values("Name", ascending = True).head()

                  Name                   Team Position   Birthday    Salary
52        Aaron Gordon          Orlando Magic       PF 1995-09-16  19863636
101      Aaron Holiday         Indiana Pacers       PG 1996-09-30   2239200
437        Abdel Nader  Oklahoma City Thunder       SF 1993-09-25   1618520
81         Adam Mokoka          Chicago Bulls        G 1998-07-18     79568
399  Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000

In [41]:
nba.sort_values("Name", ascending = False).head()

                Name                  Team Position   Birthday    Salary
248   Zylan Cheatham  New Orleans Pelicans       SF 1995-11-17     79568
137  Zion Williamson  New Orleans Pelicans        F 2000-07-06   9757440
312     Zhaire Smith    Philadelphia 76ers       SG 1999-06-04   3058800
302     Zach Norvell    Los Angeles Lakers       SG 1997-12-09     79568
159      Zach LaVine         Chicago Bulls       PG 1995-03-10  19500000

In [43]:
nba.sort_values(by = ["Team", "Salary"], ascending = True).head()

                Name           Team Position   Birthday   Salary
197    Charlie Brown  Atlanta Hawks       SG 1997-02-02    79568
276  Brandon Goodwin  Atlanta Hawks       PG 1995-10-02    79568
438   Bruno Fernando  Atlanta Hawks        C 1998-08-15  1400000
290   Tyrone Wallace  Atlanta Hawks       PG 1994-06-10  1620564
130     Damian Jones  Atlanta Hawks        C 1995-06-30  2305057

In [44]:
nba.sort_values(by = ["Team", "Salary"], ascending = False).head()

              Name                Team Position   Birthday    Salary
251      John Wall  Washington Wizards       PG 1990-09-06  38199000
35    Bradley Beal  Washington Wizards       SG 1993-06-28  27093018
49     Ian Mahinmi  Washington Wizards        C 1986-11-05  15450051
36   Thomas Bryant  Washington Wizards        C 1997-07-31   8000000
226  Davis Bertans  Washington Wizards       PF 1992-11-12   7000000

In [46]:
nba.sort_values(by = ["Team", "Salary"], ascending = [True, False]).head()

                 Name           Team Position   Birthday    Salary
111  Chandler Parsons  Atlanta Hawks       SF 1988-10-25  25102512
28        Evan Turner  Atlanta Hawks       PG 1988-10-27  18606556
167      Allen Crabbe  Atlanta Hawks       SG 1992-04-09  18500000
213   De'Andre Hunter  Atlanta Hawks       SF 1997-12-02   7068360
339     Jabari Parker  Atlanta Hawks       PF 1995-03-15   6500000

In [47]:
nba.sort_values(
    by = ["Team", "Salary"], 
    ascending = [True, False],
    inplace = True
)

In [48]:
nba.head()

                 Name           Team Position   Birthday    Salary
111  Chandler Parsons  Atlanta Hawks       SF 1988-10-25  25102512
28        Evan Turner  Atlanta Hawks       PG 1988-10-27  18606556
167      Allen Crabbe  Atlanta Hawks       SG 1992-04-09  18500000
213   De'Andre Hunter  Atlanta Hawks       SF 1997-12-02   7068360
339     Jabari Parker  Atlanta Hawks       PF 1995-03-15   6500000

## Sort Index

In [49]:
nba = pd.read_csv(
    "nba.csv",
    parse_dates = ["Birthday"],
    index_col = "Name"
)

nba.head()

                              Team Position   Birthday   Salary
Name
Shake Milton    Philadelphia 76ers       SG 1996-09-26  1445697
Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
PJ Washington    Charlotte Hornets       PF 1998-08-23  3831840
Derrick Rose       Detroit Pistons       PG 1988-10-04  7317074
Marial Shayok   Philadelphia 76ers        G 1995-07-26    79568

In [51]:
nba.sort_index().head()
nba.sort_index(ascending = True).head()

                                    Team Position   Birthday    Salary
Name
Aaron Gordon               Orlando Magic       PF 1995-09-16  19863636
Aaron Holiday             Indiana Pacers       PG 1996-09-30   2239200
Abdel Nader        Oklahoma City Thunder       SF 1993-09-25   1618520
Adam Mokoka                Chicago Bulls        G 1998-07-18     79568
Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000

In [52]:
nba.sort_index(ascending = False).head()

                                 Team Position   Birthday    Salary
Name
Zylan Cheatham   New Orleans Pelicans       SF 1995-11-17     79568
Zion Williamson  New Orleans Pelicans        F 2000-07-06   9757440
Zhaire Smith       Philadelphia 76ers       SG 1999-06-04   3058800
Zach Norvell       Los Angeles Lakers       SG 1997-12-09     79568
Zach LaVine             Chicago Bulls       PG 1995-03-10  19500000

In [54]:
nba.sort_index(axis = 0).head()
nba.sort_index(axis = "index").head()

                                    Team Position   Birthday    Salary
Name
Aaron Gordon               Orlando Magic       PF 1995-09-16  19863636
Aaron Holiday             Indiana Pacers       PG 1996-09-30   2239200
Abdel Nader        Oklahoma City Thunder       SF 1993-09-25   1618520
Adam Mokoka                Chicago Bulls        G 1998-07-18     79568
Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000

In [56]:
nba.sort_index(axis = 1).head()
nba.sort_index(axis = "columns").head()

                 Birthday Position   Salary                Team
Name
Shake Milton   1996-09-26       SG  1445697  Philadelphia 76ers
Christian Wood 1995-09-27       PF  1645357     Detroit Pistons
PJ Washington  1998-08-23       PF  3831840   Charlotte Hornets
Derrick Rose   1988-10-04       PG  7317074     Detroit Pistons
Marial Shayok  1995-07-26        G    79568  Philadelphia 76ers

In [57]:
nba.sort_index(axis = "columns", ascending = False).head()

                              Team   Salary Position   Birthday
Name
Shake Milton    Philadelphia 76ers  1445697       SG 1996-09-26
Christian Wood     Detroit Pistons  1645357       PF 1995-09-27
PJ Washington    Charlotte Hornets  3831840       PF 1998-08-23
Derrick Rose       Detroit Pistons  7317074       PG 1988-10-04
Marial Shayok   Philadelphia 76ers    79568        G 1995-07-26

## Accessing Row by Label

In [71]:
nba.sort_index(ascending = True, axis = "index", inplace = True)
nba.sort_index(ascending = True, axis = "columns", inplace = True)
nba.head()

                    Birthday Position    Salary                   Team
Name
Aaron Gordon      1995-09-16       PF  19863636          Orlando Magic
Aaron Holiday     1996-09-30       PG   2239200         Indiana Pacers
Abdel Nader       1993-09-25       SF   1618520  Oklahoma City Thunder
Adam Mokoka       1998-07-18        G     79568          Chicago Bulls
Admiral Schofield 1997-03-30       SF   1000000     Washington Wizards

In [16]:
nba.loc["Kawhi Leonard"]

Team        Los Angeles Clippers
Position                      SF
Birthday     1991-06-29 00:00:00
Salary                  32742000
Name: Kawhi Leonard, dtype: object

In [17]:
nba.loc[["Kawhi Leonard", "Paul George"]]

                               Team Position   Birthday    Salary
Name
Kawhi Leonard  Los Angeles Clippers       SF 1991-06-29  32742000
Paul George    Los Angeles Clippers       SF 1990-05-02  33005556

In [60]:
nba.loc[["Paul George", "Kawhi Leonard"]]

                               Team Position   Birthday    Salary
Name
Paul George    Los Angeles Clippers       SF 1990-05-02  33005556
Kawhi Leonard  Los Angeles Clippers       SF 1991-06-29  32742000

## Select by Index Position

In [63]:
nba.iloc[350]

Team            Toronto Raptors
Position                     SF
Birthday    1995-10-25 00:00:00
Salary                  4000000
Name: Patrick McCaw, dtype: object

In [65]:
nba.iloc[[350, 355]]

nba.iloc[[355, 350]]

                                     Team Position   Birthday   Salary
Name
Quinndary Weatherspoon  San Antonio Spurs        G 1996-09-10    79568
Patrick McCaw             Toronto Raptors       SF 1995-10-25  4000000

In [67]:
# Endpoint is exclusive
nba.iloc[350:355]

                                   Team Position   Birthday    Salary
Name
Patrick McCaw           Toronto Raptors       SF 1995-10-25   4000000
Patrick Patterson  Los Angeles Clippers       PF 1989-03-14   3068660
Paul George        Los Angeles Clippers       SF 1990-05-02  33005556
Paul Millsap             Denver Nuggets       PF 1985-02-10  30000000
Quinn Cook           Los Angeles Lakers       PG 1993-03-23   3000000

In [73]:
# Endpoint is exclusive
nba.iloc[-15:-12]

                  Birthday Position   Salary              Team
Name
Wenyen Gabriel  1997-03-26       PF    79568  Sacramento Kings
Wesley Iwundu   1994-12-20       SF  1618520     Orlando Magic
Wesley Matthews 1986-10-14       SF  2564753   Milwaukee Bucks

## Select by Row and Column

In [69]:
nba.loc["Joel Embiid", "Salary"]

27504630

In [77]:
# Endpoint is exclusive with labels
nba.loc["Joel Embiid":"John Wall", "Salary"]

Name
Joel Embiid     27504630
John Collins     2686560
John Henson      9732396
John Konchar       79568
John Wall       38199000
Name: Salary, dtype: int64

In [78]:
# Endpoint is exclusive with labels
nba.loc["Joel Embiid", "Position":"Salary"]

Position           C
Salary      27504630
Name: Joel Embiid, dtype: object

In [79]:
# Endpoint is exclusive with labels
nba.loc["Joel Embiid":"John Wall", "Position":"Salary"]

             Position    Salary
Name
Joel Embiid         C  27504630
John Collins       PF   2686560
John Henson         C   9732396
John Konchar       SG     79568
John Wall          PG  38199000